<%@ Page Title="С чего начать" Language="C#" MasterPageFile="~/Site.Master" AutoEventWireup="true" CodeBehind="Default.aspx.cs" Inherits="AjaxCorporation.LostFound._Default" %>

<asp:Content ID="BodyContent" ContentPlaceHolderID="MainContent" runat="server">
    <div>
        <h3>Пропажа</h3>
    <p>Вы потеряли любимоое животное, сумочку или зонтик, а может быть, что-то другое? Не переживайте! У нас есть информация обо всех пропажах и находках! Мы обязательно поможем вам отыскать вашу пропажу.</p>
    <p>Для того чтобы мы могли помочь Вам в ваших поисках, заполните информацию о Вашей пропаже в разделе "Информация о находке" в столбце "Инфоромация о потерянном объекте".</p>
    </div>
   <div>
       <h3>Находка</h3>
    <p>Вы нашли потерявшееся животное или вещь? Вы можете помочь пропаже вернуться к хозяину! Для этого заполните информацию о Вашей находке в разделе "Информация о находке" в столбце "Инфоромация о найденном объекте".</p>
    <p></p>
   </div> 
</asp:Content>
